Autodesk.Navisworks.Api.Plugins.AddInLocation
Location of an AddInPlugin in the Navisworks menus system

Autodesk.Navisworks.Api.Plugins.AddInLocation.None
Do not display in the menus

Autodesk.Navisworks.Api.Plugins.AddInLocation.AddIn
Display in the Addin menu

Autodesk.Navisworks.Api.Plugins.AddInLocation.Import
Display in the Import menu

Autodesk.Navisworks.Api.Plugins.AddInLocation.Export
Display in the Export menu

Autodesk.Navisworks.Api.Plugins.AddInLocation.Help
Display in the Help menu

Autodesk.Navisworks.Api.Plugins.AddInLocation.CurrentSelectionContextMenu
Display in the Context menu for currently selected ModelItem

Autodesk.Navisworks.Api.Plugins.AddInLocation.CurrentSelection2DContextMenu
Display in the 2D Context menu for currently selected ModelItem